src/cf/Documents/ДанныеДокументаМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ДанныеДокументаМЭДО</Name>
			<Comment>Дополнительная детализация документа для МЭДО</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.СостоянияДокументовМЭДО</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйФайл</Name>
					<Comment>Главный документ из сообщения, остальные - приложения к нему</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Файлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГотовКОтправке</Name>
					<Comment>Для исходящего</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГрифДоступа</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ГрифДоступаМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Comment>Для входящего - из паспорта сообщения, для исходящего - GUID из ссылки на документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестоСоставления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.МестаСоставленияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Организация</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ОтветственныйМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Comment>Для исходящего</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредыдущаяОтправка</Name>
					<Comment>Для повторной отправки одного этого же документа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущееСостояние</Name>
					<Comment>Для отбора в списке</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВерсияМЭДО</Name>
					<Comment>Удален в релизе 3.0.11</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаМЭДО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьИдентификаторСообщения</Name>
					<Comment>Удален в релизе 3.0.11</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Пакеты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВерсияМЭДО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВерсииФорматаМЭДО</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСообщения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/InformationRegisters/НастройкиКонтрагентовМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>НастройкиКонтрагентовМЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>АдресМЭДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>АктуализироватьВерсию</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияФорматаМЭДО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВерсииФорматаМЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтрагентМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/СостоянияДокументовМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СостоянияДокументовМЭДО</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ИдентификаторДокумента</Name>
					<Comment>Для входящего - из паспорта сообщения МЭДО, для исходящего - генерируется наш GUID</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторСообщения</Name>
					<Comment>Для входящего из электронного сообщения. Для исходящего - генерируется системой</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПредметСообщения</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметСообщенияМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияДокументовМЭДО</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:EnumRef.НаправленияСообщенийМЭДО</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметМЭДО</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/УровниСобытийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>УровниСобытийМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Информация</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/НаправленияСообщенийМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>НаправленияСообщенийМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Входящее</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Исходящее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/СостоянияДокументовМЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>СостоянияДокументовМЭДО</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВходящийДокументЗарегистрирован</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументЗарегистрированГотовКОтправке</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументОтправлен</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументПолучен</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящееУведомлениеЕщеНеОтправлено</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящийДокументЕщеНеОтправлен</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсходящаяКвитанцияЕщеНеОтправлена</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправкаОтменена</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаКвитанция</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленаКвитанцияОбОшибке</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтправленоУведомление</Name>
					<Comment>Для входящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученаКвитанция</Name>
					<Comment>Для исходящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученаКвитанцияОбОшибке</Name>
					<Comment>Для исходящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПолученоУведомление</Name>
					<Comment>Для исходящих документов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданаИсходящаяКвитанция</Name>
					<Comment>Для входящих документов и уведомлений</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СозданоИсходящееУведомление</Name>
					<Comment>для входящих документов</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Documents/ДанныеДокументаМЭДО/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеОтвета = МЭДОСтруктурыДанных.НовыйЛегкийОтвет();
	
	// Проверка на уникальность по полю документ, должен быть только один документ "Данные документа МЭДО",
	// кроме ситуации повторной отправки (ПропуститьПроверкуУникальности):
	Если ЭтоНовый() И Не ДополнительныеСвойства.Свойство("ПропуститьПроверкуУникальности") Тогда
		ДанныеПоЭтомуЖеДокументу = Документы.ДанныеДокументаМЭДО.ДанныеДокументаМЭДО(
			Документ, "Ссылка", ДанныеОтвета);
		Если ЗначениеЗаполнено(ДанныеПоЭтомуЖеДокументу.Ссылка) Тогда
			ТекстОшибкиПодробно = СтрШаблон(
				НСтр("ru = 'Попытка второй раз создать ""Данные документа МЭДО"", уже есть другой объект: %1'"),
				ДанныеПоЭтомуЖеДокументу.Ссылка);
			МЭДО.ЗаписьВЖурналСобытий(
				Перечисления.УровниСобытийМЭДО.Ошибка,
				ДанныеПоЭтомуЖеДокументу.Ссылка,
				НСтр("ru = 'Ошибка при записи ""Данных документа МЭДО""'"),
				ТекстОшибкиПодробно,
				ДанныеОтвета);
			Отказ = Истина;
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		МЭДО.ПрисвоитьЗаполненное(Ответственный, МЭДОПереопределяемый.ТекущийОтветственный());
	КонецЕсли;
	
	// Пометка удаления должна быть такая же, как у родительского документа:
	//@skip-check bsl-legacy-check-string-literal
	ПометкаУдаления = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Документ, "ПометкаУдаления");
	
	Если Не ПометкаУдаления Тогда
		РежимЗаписи = РежимЗаписиДокумента.Проведение;
	КонецЕсли;
	
	
	Если ЭтоНовый() Тогда
		Дата = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// Часть реквизитов можно достать сразу из родительского документа:
	Если МЭДОПереопределяемый.ЭтоИсходящийДокумент(Документ) Тогда
		
		// Для исходящего документа присвоим свой идентификатор из ссылки на документ:
		Если Не ЗначениеЗаполнено(ИдентификаторДокумента) Тогда
			ИдентификаторДокумента = НРег("" + Документ.УникальныйИдентификатор());
		КонецЕсли;
	
		РеквизитыДокумента = МЭДОПереопределяемый.ТребуемыеДанныеИсходящегоДокумента(
			Документ, "Организация, Контрагенты, ГрифДоступа, ДатаРегистрации");
		ГрифДоступа = РеквизитыДокумента.ГрифДоступа;
		Организация = РеквизитыДокумента.Организация;
		
		// Определяем версии для отправки, у всех контрагентов, в общем случае их может быть несколько.
		// Делим сообщение на пакеты по версиям, в итоге по МЭДО будет отправлено столько сообщений,
		// сколько разных версий МЭДО у контрагентов.
		Контрагенты = Новый Массив();
		Для Каждого СтруктураКонтрагент Из РеквизитыДокумента.Контрагенты Цикл
			Контрагенты.Добавить(СтруктураКонтрагент.Контрагент);
		КонецЦикла;
		ТаблицаНастроек = РегистрыСведений.НастройкиКонтрагентовМЭДО.НастройкиМассиваКонтрагентов(
			Контрагенты, ДанныеОтвета);
		Если Не ДанныеОтвета.Успех И Не ПометкаУдаления Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		ТаблицаНастроек.Свернуть("ВерсияФорматаМЭДО");
		Если ТаблицаНастроек.Количество() = 0 Тогда // Если не заданы, то версия всем по умолчанию - последняя.
			СтрокаТЗ = ТаблицаНастроек.Добавить();
			СтрокаТЗ.ВерсияФорматаМЭДО = Перечисления.ВерсииФорматаМЭДО.ПоследняяВерсия();
		КонецЕсли;
		// Идентификаторы в ТЧ Пакеты не должны меняться, если они там уже есть, поэтому
		// только добавление строк:
		Для Каждого СтрокаТЗВерсии Из ТаблицаНастроек Цикл
			ВерсияМЭДО = МЭДО.ЗаполненноеЗначение(
				СтрокаТЗВерсии.ВерсияФорматаМЭДО, Перечисления.ВерсииФорматаМЭДО.ПоследняяВерсия());
			
			СтрокаТЧ = Пакеты.Найти(ВерсияМЭДО, "ВерсияМЭДО");
			Если СтрокаТЧ = Неопределено Тогда
				СтрокаТЧ = Пакеты.Добавить();
				СтрокаТЧ.ВерсияМЭДО = ВерсияМЭДО;
				СтрокаТЧ.ИдентификаторСообщения = "" + Новый УникальныйИдентификатор();
			КонецЕсли;
		КонецЦикла;
		
		Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее;
		МЭДО.ПрисвоитьЗаполненное(ДатаРегистрации, НачалоДня(РеквизитыДокумента.ДатаРегистрации));
	
	ИначеЕсли МЭДОПереопределяемый.ЭтоВходящийДокумент(Документ) Тогда
		
		РеквизитыДокумента = МЭДОПереопределяемый.ТребуемыеДанныеВходящегоДокумента(
			Документ, "Организация, Контрагент, ГрифДоступа, ДатаРегистрации");
		ГрифДоступа = РеквизитыДокумента.ГрифДоступа;
		Организация = РеквизитыДокумента.Организация;
		
		// Во входящем документе один контрагент:
		// Определяем версию для отправки по контрагенту, если не проставлено, 
		// то останется по умолчанию:
		НастройкиКонтрагента = РегистрыСведений.НастройкиКонтрагентовМЭДО.НастройкиКонтрагента(
				РеквизитыДокумента.Контрагент, ДанныеОтвета);
		Если Не ДанныеОтвета.Успех И Не ПометкаУдаления Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		СтрокаТЧ = Неопределено;
		Если Пакеты.Количество() = 0 Тогда
			СтрокаТЧ = Пакеты.Добавить();
			СтрокаТЧ.ИдентификаторСообщения
				= "" + МЭДОПереопределяемый.СсылкаНовогоОбъекта(ЭтотОбъект).УникальныйИдентификатор();
		Иначе
			СтрокаТЧ = Пакеты[0];
		КонецЕсли;
		СтрокаТЧ.ВерсияМЭДО = МЭДО.ЗаполненноеЗначение(
			НастройкиКонтрагента.ВерсияФорматаМЭДО, Перечисления.ВерсииФорматаМЭДО.ПоследняяВерсия());
		
		Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее;
		МЭДО.ПрисвоитьЗаполненное(ДатаРегистрации, НачалоДня(РеквизитыДокумента.ДатаРегистрации));
		
	КонецЕсли;
	
	Если ГотовКОтправке И Не ЗначениеЗаполнено(ДатаРегистрации) Тогда
		МЭДО.ЗаписьВЖурналСобытий(
			Перечисления.УровниСобытийМЭДО.Ошибка,
			Ссылка,
			НСтр("ru = 'Ошибка при записи ""Данных документа МЭДО""'"),
			НСтр("ru = 'Незарегистрированный документ не может быть отправлен!'"),
			ДанныеОтвета);
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ГлавныйФайл) Тогда
		ГлавныйФайл = МЭДОПереопределяемый.ПопытатьсяОпределитьГлавныйФайл(Документ);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.СостоянияДокументовМЭДО.Записывать = Истина;
	Счетчик = 0;
	
	Для Каждого СтрокаТЧ Из Пакеты Цикл
	
		Движение = Движения.СостоянияДокументовМЭДО.Добавить();
		ЗаполнитьЗначенияСвойств(
			Движение, ЭтотОбъект, "Направление, Документ, ИдентификаторДокумента");
		Движение.ИдентификаторСообщения = СтрокаТЧ.ИдентификаторСообщения;
		Счетчик = Счетчик + 1;
		Движение.Период = Дата + Счетчик;
		Движение.ПредметСообщения = Ссылка;
		
		Если Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ИсходящийДокументЕщеНеОтправлен;
		ИначеЕсли Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее Тогда
			Движение.Состояние = Перечисления.СостоянияДокументовМЭДО.ДокументПолучен;
		КонецЕсли;
		
	КонецЦикла;
	
	
	// Второе движение:
	Состояние2 = Неопределено;
	Если ЗначениеЗаполнено(ДатаРегистрации) Тогда
		Если Направление = Перечисления.НаправленияСообщенийМЭДО.Исходящее Тогда
			Если Отправлен Тогда
				Состояние2 = Перечисления.СостоянияДокументовМЭДО.ДокументОтправлен;
			ИначеЕсли ГотовКОтправке И ЗначениеЗаполнено(ДатаРегистрации) Тогда 
				Состояние2 = Перечисления.СостоянияДокументовМЭДО.ДокументЗарегистрированГотовКОтправке;
			КонецЕсли;
		ИначеЕсли Направление = Перечисления.НаправленияСообщенийМЭДО.Входящее Тогда
			Состояние2 = Перечисления.СостоянияДокументовМЭДО.ВходящийДокументЗарегистрирован;
		КонецЕсли;
	КонецЕсли;
	Если ЗначениеЗаполнено(Состояние2) Тогда
		Для Каждого СтрокаТЧ Из Пакеты Цикл
			Движение = Движения.СостоянияДокументовМЭДО.Добавить();
			Счетчик = Счетчик + 1;
			ДатаДвижения2 = ДатаРегистрации + Счетчик;
			Если ДатаДвижения2 < Дата + Счетчик Тогда
				ДатаДвижения2 = Дата + Счетчик; // Второе движение должно быть позднее первого.
			КонецЕсли;
			
			Движение.Период = ДатаДвижения2;
			Движение.ПредметСообщения = Ссылка;
			ЗаполнитьЗначенияСвойств(
				Движение, ЭтотОбъект, "Направление, Документ, ИдентификаторДокумента");
			Движение.ИдентификаторСообщения = СтрокаТЧ.ИдентификаторСообщения;
			Движение.Состояние = Состояние2;
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Иначе

#Область Инициализация
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецОбласти

#КонецЕсли
